#include <iostream>
#include <cmath>
// [1],...,[4] - кроки роботи функції
using namespace std;
double f(double x) { //[1] Створюю функцію f та задаю їй параметр integer х.
    double y = 1 -  //[3] Фукнція рахує моє число y використовуючи x з циклу у функції main().
               (pow(x, 2)) / 2 +
               (pow(x, 4)) / 4 +
               (pow(x, 6) / 6);
    return y; //[4] Моя функція f повертає значення y, яке потім підставляеться у c-out замість функції f(x)
}

int main() {
    for (double x = 0; x <= 12; x++) { //Задаю функцію та виводжу її значення з кроком 1 за допомогою циклу for
        cout << "If x=" << x << ", f(x)=" << f(x) << "\n"; //[2] функція f бере з циклу значення х.
    }
    return 1;
}